[
    {
        "reviewer_name": "RAVI",
        "review_text": " I have been following so many trading groups, but GREED & FEAR  is the only one which has more accuracy and transparent analysis methods i have ever seen...i believe Elliott wave analysis method is the most predictable analysis which anyone can learn...it has been proven here..thank you very much for the learning support and guidance. ",
        "logo_path": "https://s3.greedandfear.fun/logopics/ravi.jpeg"
    },
    {
        "reviewer_name": "NIDHIL ",
        "review_text": "very helpful for beginners and novice traders like me. based on the charts shared by them i made almost 300% returns within a week with just equity setups. ",
        "logo_path": "https://s3.greedandfear.fun/logopics/nidil.jpeg"
    },
    {
        "reviewer_name": "Sridharan N",
        "review_text": "I am senior citizen just joined this esteemed group . Analysis is very neat with highest accuracy i have ever seen. the prices of the premium groups are also affordable and provide 10 times more value. thank you so much for providing us this facility. god bless you. ",
        "logo_path": "https://s3.greedandfear.fun/logopics/sridhan.jpeg"
    },
    {
        "reviewer_name": "Girish",
        "review_text": "amazing analysis, your skills are commendable in prior. i just want to associate with you in learning . it seems like you guys are well versed in technical analysis. moreover yesterday i saw your chart of godrejCP , it was commendable. the way it touched all your levels, no words .",
        "logo_path": "https://s3.greedandfear.fun/logopics/gopal.jpeg"
    },
    {
        "reviewer_name": "Anand ",
        "review_text": "Amazing analysis, your skills are commendable in prior. i just want to associate with you in learning . it seems like you guys are well versed in technical analysis. moreover yesterday i saw your chart of godrejCP , it was commendable. the way it touched all your levels, no words .",
        "logo_path": "https://s3.greedandfear.fun/logopics/anand.jpeg"
    },
    {
        "reviewer_name": "Gopal ",
        "review_text": " i’m highly influenced with your style of trading and setups. the strategies you provided in elite batch is a gem, i have never seen such technical analysis anywhere. pure genius!",
        "logo_path": "https://s3.greedandfear.fun/logopics/girish.jpeg"
    }
]